src/main/java/ok/dht/test/monakhov/report/stage5/wrk2_get_rate_1850.txt
Running 1m test @ http://localhost:19234
  16 threads and 16 connections
  Thread calibration: mean lat.: 11.805ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 11.466ms, rate sampling interval: 36ms
  Thread calibration: mean lat.: 13.150ms, rate sampling interval: 51ms
  Thread calibration: mean lat.: 11.981ms, rate sampling interval: 43ms
  Thread calibration: mean lat.: 12.143ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 11.343ms, rate sampling interval: 32ms
  Thread calibration: mean lat.: 10.337ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 14.249ms, rate sampling interval: 65ms
  Thread calibration: mean lat.: 14.650ms, rate sampling interval: 75ms
  Thread calibration: mean lat.: 13.210ms, rate sampling interval: 54ms
  Thread calibration: mean lat.: 13.979ms, rate sampling interval: 67ms
  Thread calibration: mean lat.: 11.656ms, rate sampling interval: 37ms
  Thread calibration: mean lat.: 12.861ms, rate sampling interval: 44ms
  Thread calibration: mean lat.: 13.802ms, rate sampling interval: 55ms
  Thread calibration: mean lat.: 10.653ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 13.493ms, rate sampling interval: 53ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.74ms    3.15ms  39.49ms   79.37%
    Req/Sec   116.76     14.13   178.00     70.85%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.05ms
 75.000%   10.92ms
 90.000%   13.49ms
 99.000%   21.39ms
 99.900%   29.34ms
 99.990%   35.62ms
 99.999%   37.95ms
100.000%   39.52ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.021     0.000000            1         1.00
       6.715     0.100000         9259         1.11
       7.403     0.200000        18569         1.25
       7.967     0.300000        27780         1.43
       8.495     0.400000        37015         1.67
       9.047     0.500000        46258         2.00
       9.343     0.550000        50906         2.22
       9.671     0.600000        55536         2.50
      10.031     0.650000        60178         2.86
      10.439     0.700000        64810         3.33
      10.919     0.750000        69433         4.00
      11.191     0.775000        71676         4.44
      11.511     0.800000        74034         5.00
      11.879     0.825000        76331         5.71
      12.303     0.850000        78637         6.67
      12.815     0.875000        80920         8.00
      13.143     0.887500        82110         8.89
      13.487     0.900000        83243        10.00
      13.911     0.912500        84398        11.43
      14.399     0.925000        85548        13.33
      14.967     0.937500        86711        16.00
      15.311     0.943750        87279        17.78
      15.727     0.950000        87860        20.00
      16.183     0.956250        88437        22.86
      16.719     0.962500        89022        26.67
      17.311     0.968750        89592        32.00
      17.695     0.971875        89880        35.56
      18.111     0.975000        90170        40.00
      18.591     0.978125        90460        45.71
      19.167     0.981250        90746        53.33
      19.807     0.984375        91037        64.00
      20.207     0.985938        91185        71.11
      20.623     0.987500        91326        80.00
      21.055     0.989062        91470        91.43
      21.679     0.990625        91613       106.67
      22.319     0.992188        91756       128.00
      22.687     0.992969        91833       142.22
      23.151     0.993750        91904       160.00
      23.583     0.994531        91975       182.86
      24.111     0.995313        92048       213.33
      24.655     0.996094        92117       256.00
      24.863     0.996484        92154       284.44
      25.151     0.996875        92192       320.00
      25.615     0.997266        92226       365.71
      26.143     0.997656        92262       426.67
      26.927     0.998047        92298       512.00
      27.263     0.998242        92316       568.89
      27.551     0.998437        92334       640.00
      28.175     0.998633        92353       731.43
      28.703     0.998828        92370       853.33
      29.455     0.999023        92388      1024.00
      30.031     0.999121        92397      1137.78
      30.495     0.999219        92407      1280.00
      30.847     0.999316        92415      1462.86
      31.263     0.999414        92424      1706.67
      31.871     0.999512        92433      2048.00
      32.287     0.999561        92438      2275.56
      32.559     0.999609        92442      2560.00
      32.991     0.999658        92447      2925.71
      33.695     0.999707        92451      3413.33
      34.367     0.999756        92456      4096.00
      34.559     0.999780        92458      4551.11
      34.815     0.999805        92460      5120.00
      35.199     0.999829        92463      5851.43
      35.359     0.999854        92466      6826.67
      35.519     0.999878        92468      8192.00
      35.519     0.999890        92468      9102.22
      35.615     0.999902        92470     10240.00
      35.679     0.999915        92471     11702.86
      35.999     0.999927        92472     13653.33
      36.031     0.999939        92473     16384.00
      36.031     0.999945        92473     18204.44
      36.063     0.999951        92474     20480.00
      36.383     0.999957        92475     23405.71
      36.383     0.999963        92475     27306.67
      37.151     0.999969        92476     32768.00
      37.151     0.999973        92476     36408.89
      37.151     0.999976        92476     40960.00
      37.951     0.999979        92477     46811.43
      37.951     0.999982        92477     54613.33
      37.951     0.999985        92477     65536.00
      37.951     0.999986        92477     72817.78
      37.951     0.999988        92477     81920.00
      39.519     0.999989        92478     93622.86
      39.519     1.000000        92478          inf
#[Mean    =        9.736, StdDeviation   =        3.150]
#[Max     =       39.488, Total count    =        92478]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  110991 requests in 1.00m, 586.09MB read
Requests/sec:   1850.16
Transfer/sec:      9.77MB